post/csapp-cachelab.html
<!DOCTYPE html>
<html>
<head>
<!-- 2016-11-03 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>CSAPP-Cachelab</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Kangwei Ling">
<meta  name="description" content="cachelab"
>
<meta name='viewport' content='width=device-width, initial-scale=1.0'>
<link rel="stylesheet" type="text/css" href="/assets/css/style.css"/>
<link rel="stylesheet" type="text/css" href="/assets/css/code.css"/>
<link rel="stylesheet" type="text/css" href="/assets/css/main.css"/>
</head>
<body>
<header id="site-header" class="status">
<div class="wrapper">
    <a class="site-title" href="/">Kevin&#39;s Blog</a>
    <nav class="site-nav">
        <span class="menu-icon">
            <svg viewBox="0 0 18 15" width="18px" height="15px">
                <path fill="#424242" d="M18,1.484c0,0.82-0.665,1.484-1.484,1.484H1.484C0.665,2.969,0,2.304,0,1.484l0,0C0,0.665,0.665,0,1.484,0 h15.031C17.335,0,18,0.665,18,1.484L18,1.484z"/>
                <path fill="#424242" d="M18,7.516C18,8.335,17.335,9,16.516,9H1.484C0.665,9,0,8.335,0,7.516l0,0c0-0.82,0.665-1.484,1.484-1.484 h15.031C17.335,6.031,18,6.696,18,7.516L18,7.516z"/>
                <path fill="#424242" d="M18,13.516C18,14.335,17.335,15,16.516,15H1.484C0.665,15,0,14.335,0,13.516l0,0 c0-0.82,0.665-1.484,1.484-1.484h15.031C17.335,12.031,18,12.696,18,13.516L18,13.516z"/>
            </svg>
        </span>
        <div class="trigger">
            <a class="page-link" href="http://wiki.lingkangwei.me">Wiki</a>
            <a class="page-link" href="/about.html">About</a>
        </div>
    </nav>
</div>
</header>
<main id="page-content">
<header>
<h1 class="title">CSAPP-Cachelab</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">Part A: Cache Simulator</a>
<ul>
<li><a href="#orgheadline2">Parse Command Line Arguments</a></li>
<li><a href="#orgheadline3">Cache Data Structure</a>
<ul>
<li><a href="#orgheadline4">Types</a></li>
<li><a href="#orgheadline5">Methods to manipulate the cache</a></li>
</ul>
</li>
<li><a href="#orgheadline6">Simulation</a></li>
<li><a href="#orgheadline7">LRU</a></li>
</ul>
</li>
<li><a href="#orgheadline8">Optimizing Matrix Transpose</a>
<ul>
<li><a href="#orgheadline9">32 x 32</a></li>
<li><a href="#orgheadline10">64 x 64</a></li>
<li><a href="#orgheadline11">61 x 67</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<p>
You can find my work on this lab at <a href="https://github.com/kevinkwl/CSAPP-Labs/tree/master/cachelab">Github Repo</a>.
</p>

<section id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Part A: Cache Simulator</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
To implement a cache simulator, we must accomplish the following jobs:
</p>
<ul class="org-ul">
<li>Take command line arguments to setup a cache simulator with specific structure(number of sets, block size, associativity)</li>
<li>Implement cache data structure</li>
<li>Use traces generated by <code>Valgrind</code> to simulate the cache access</li>
<li>Implement LRU policy for cache replacement.</li>
</ul>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">Parse Command Line Arguments</h3>
<div class="outline-text-3" id="text-orgheadline2">
<p>
Use <code>getopt</code> function defined in header <code>getopt.h</code>. It's very easy to setup it for argument parsing.
</p>
<div class="org-src-container">

<pre class="src src-c"><span class="org-type">char</span>* <span class="org-variable-name">opts</span> = <span class="org-string">"hvs:E:b:t:"</span>;
<span class="org-type">int</span> <span class="org-variable-name">opt</span>;
<span class="org-keyword">while</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-rainbow-delimiters-depth-2">(</span>opt = getopt<span class="org-rainbow-delimiters-depth-3">(</span>argc, argv, opts<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span> != -<span class="org-highlight-numbers-number">1</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    ...
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">Cache Data Structure</h3>
<div class="outline-text-3" id="text-orgheadline3">
<p>
In this lab, I use doubly-linked list to implement a set in cache, with
additional head and tail node to simplify the insert and delete process.
</p>
</div>
<div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4">Types</h4>
<div class="outline-text-4" id="text-orgheadline4">
<div class="org-src-container">

<pre class="src src-c"><span class="org-keyword">typedef</span> <span class="org-keyword">struct</span> <span class="org-type">_cache_line</span>
<span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-type">Address</span> <span class="org-variable-name">tag</span>;
    <span class="org-keyword">struct</span> <span class="org-type">_cache_line</span> *<span class="org-variable-name">prev</span>;
    <span class="org-keyword">struct</span> <span class="org-type">_cache_line</span> *<span class="org-variable-name">next</span>;
<span class="org-rainbow-delimiters-depth-1">}</span><span class="org-type">CacheLine</span>, *<span class="org-type">PCacheLine</span>;
</pre>
</div>
<p>
Here, <b>Address</b> is just an alias for <code>unsigned long long int</code> type.
</p>

<p>
<b>Cache</b> is defined as follows:
</p>
<div class="org-src-container">

<pre class="src src-c"><span class="org-keyword">typedef</span> <span class="org-keyword">struct</span> <span class="org-type">_cache</span>
<span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-type">int</span> <span class="org-variable-name">n_sets</span>;
    <span class="org-type">int</span> <span class="org-variable-name">associativity</span>;
    <span class="org-type">int</span> <span class="org-variable-name">index_mask</span>;
    <span class="org-type">int</span> <span class="org-variable-name">index_offset</span>;
    <span class="org-type">int</span> <span class="org-variable-name">tag_offset</span>;
    <span class="org-type">PCacheLine</span> *<span class="org-variable-name">set_head</span>;
    <span class="org-type">PCacheLine</span> *<span class="org-variable-name">set_tail</span>;
    <span class="org-type">int</span>* <span class="org-variable-name">n_entries</span>;
<span class="org-rainbow-delimiters-depth-1">}</span><span class="org-type">Cache</span>, *<span class="org-type">PCache</span>;
</pre>
</div>
<p>
The <b>Cache</b> data structure store the organization of the cache and some useful
variables to use in the simulation.
</p>
<dl class="org-dl">
<dt>index_mask</dt><dd>a mask to compute the set index from addresses.</dd>
<dt>index_offset</dt><dd>bit length of the block offset part in the address.</dd>
<dt>set_head</dt><dd>a pointer to an array of cache line pointers (the head nodes)</dd>
<dt>set_tail</dt><dd>a pointer to tail nodes</dd>
<dt>n_entries</dt><dd>a pointer to an array that records number of entries of sets.</dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5">Methods to manipulate the cache</h4>
<div class="outline-text-4" id="text-orgheadline5">
<p>
There are 3 procedures to utilize the cache data structure
</p>
<div class="org-src-container">

<pre class="src src-c"><span class="org-type">void</span> <span class="org-function-name">cacheline_lru</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">Address</span> <span class="org-variable-name">tag</span>, <span class="org-type">PCacheLine</span> <span class="org-variable-name">head</span>, <span class="org-type">PCacheLine</span> <span class="org-variable-name">tail</span><span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-type">void</span> <span class="org-function-name">cacheline_new</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">Address</span> <span class="org-variable-name">tag</span>, <span class="org-type">PCacheLine</span> <span class="org-variable-name">head</span><span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-type">void</span> <span class="org-function-name">cacheline_visit</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">PCacheLine</span> <span class="org-variable-name">line</span>, <span class="org-type">PCacheLine</span> <span class="org-variable-name">head</span><span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div>
<dl class="org-dl">
<dt>cacheline_lru</dt><dd>simulate LRU process, choose the least recently used (at the
end of the list), change its tag to the newly loaded(eviction), then insert
into the head.</dd>
<dt>cacheline_new</dt><dd>insert a new line at the start of the set list.</dd>
<dt>cacheline_visit</dt><dd>under hit circumstance, update the newly visited cache line
(move it to the start of the set list).</dd>
</dl>
<p>
Note that they have some similarities, but they are just simple linked list
manipulations, I don't want bother to do more works.
</p>

<p>
Also, the initialization and destruction of <b>Cache</b> are very important, because
I use dynamic memory. I've defined two functions to handle this part.
</p>
<div class="org-src-container">

<pre class="src src-c"><span class="org-type">PCache</span> <span class="org-function-name">cache_init</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span> <span class="org-variable-name">n_idx</span>, <span class="org-type">int</span> <span class="org-variable-name">n_blk</span>, <span class="org-type">int</span> <span class="org-variable-name">n_assoc</span><span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-type">void</span> <span class="org-function-name">cache_deinit</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">PCache</span> <span class="org-variable-name">pcache</span><span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6">Simulation</h3>
<div class="outline-text-3" id="text-orgheadline6">
<p>
The simulation part is concerned with the following functions
</p>
<div class="org-src-container">

<pre class="src src-c"><span class="org-type">void</span> <span class="org-function-name">cache_sim</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">PCache</span> <span class="org-variable-name">pcache</span>, <span class="org-type">Address</span> <span class="org-variable-name">address</span>, <span class="org-type">Log</span>* <span class="org-variable-name">log</span><span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-type">void</span> <span class="org-function-name">simulate</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">char</span> *<span class="org-keyword">const</span> <span class="org-variable-name">filename</span>, <span class="org-type">PCache</span> <span class="org-variable-name">pcache</span>, <span class="org-type">Logger</span>* <span class="org-variable-name">logger</span><span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div>
<dl class="org-dl">
<dt>cache_sim</dt><dd>simulate the process of accessing cache with memory address,
log the hit-miss-eviction status into the <b>log</b> struct.</dd>
<dt>simulate</dt><dd>with the filename, open the trace file, and use the memory access
traces to call cache_sim</dd>
</dl>

<p>
In <code>simulate</code>, after each access processed, the <code>verbose</code> flag is checked, so
that valuable debug information is available.
</p>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7">LRU</h3>
<div class="outline-text-3" id="text-orgheadline7">
<p>
Using the doubly linked list, it's straightforward to implement the LRU policy.
</p>
<ul class="org-ul">
<li>Each time an access hit, that cache line will be moved to start of the linked list.</li>
<li>When miss occurs, 
<ul class="org-ul">
<li>if there are still available lines in the set, a new cache line will be inserted at the head of the linked list.</li>
<li>Otherwise, we delete the last node (not tail) from the list and reinsert
it into the front of the linked list (change its tag to the newly accessing address).</li>
</ul></li>
</ul>
</div>
</div>
</section>

<section id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8">Optimizing Matrix Transpose</h2>
<div class="outline-text-2" id="text-orgheadline8">
<p>
<b>Blocking</b> is our resort to optimize matrix transposition. But only relying on
 blocking is not enough, because the requirements are very tight. There are
 certain tricks to do this part.
</p>
</div>
<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9">32 x 32</h3>
<div class="outline-text-3" id="text-orgheadline9">
<p>
The Cache is able to store a <b>8x8</b> block, so it is good to do matrix block
transposition of block size <b>8x8</b>. This simple optimization will lead to
300~400 misses.
</p>

<p>
By inspection on the trace file using <code>csim-ref</code> and do some calculations,
it's not very hard to find out that many misses arise from transposing the
diagonal element. The ironic thing is, diagonal elements remain the same
place after transposition.
</p>

<p>
To reduce the number of misses, it's necessary to defer the access of
diagonal element to the very end of the iteration.
</p>
<div class="org-src-container">

<pre class="src src-c"><span class="org-keyword">for</span> <span class="org-rainbow-delimiters-depth-1">(</span>k = i; k &lt; i + <span class="org-highlight-numbers-number">8</span> &amp;&amp; k &lt; N; k++<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">for</span> <span class="org-rainbow-delimiters-depth-2">(</span>l = j; l &lt; j + <span class="org-highlight-numbers-number">8</span> &amp;&amp; l &lt; M; l++<span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">{</span>
        <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-3">(</span>k == l<span class="org-rainbow-delimiters-depth-3">)</span>
            <span class="org-keyword">continue</span>;
        B<span class="org-rainbow-delimiters-depth-3">[</span>l<span class="org-rainbow-delimiters-depth-3">][</span>k<span class="org-rainbow-delimiters-depth-3">]</span> = A<span class="org-rainbow-delimiters-depth-3">[</span>k<span class="org-rainbow-delimiters-depth-3">][</span>l<span class="org-rainbow-delimiters-depth-3">]</span>;
    <span class="org-rainbow-delimiters-depth-2">}</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">(</span>i == j<span class="org-rainbow-delimiters-depth-2">)</span>
        B<span class="org-rainbow-delimiters-depth-2">[</span>k<span class="org-rainbow-delimiters-depth-2">][</span>k<span class="org-rainbow-delimiters-depth-2">]</span> = A<span class="org-rainbow-delimiters-depth-2">[</span>k<span class="org-rainbow-delimiters-depth-2">][</span>k<span class="org-rainbow-delimiters-depth-2">]</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
<p>
The inner loops are shown above. This optimization reduce the misses to 287
misses.
</p>
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10">64 x 64</h3>
<div class="outline-text-3" id="text-orgheadline10">
<p>
This is the hardest part, I've tried many ways, but all failed (1300 is
really difficult). Every single optimization has to be used. I refered to
some codes on <a href="https://github.com/codeworm96/ICS-Labs/tree/master/lab7">Github</a> and finally solved this. Point is,
</p>
<ul class="org-ul">
<li>use everything you can, use local variable like register, <b>use B as buffer!</b>.</li>
<li>whenever load something into the cache, get the most out of it</li>
<li>whenever a line is in cache, store everything you can.</li>
</ul>

<p>
I've add some comments in <code>trans.c</code> file, the process is straightforward.
</p>
<ol class="org-ol">
<li>use block of size 8</li>
<li>start from the upper 4 lines, transpose the upper left sub matrix, store
other 4 elements into upper right part of B.</li>
<li>fetch elements from buffered part of B, transpose the lower left part of A, and
fetch lower right elements, insert lower part of B with element fetched.</li>
</ol>
<p>
The final result is approximately 1200+ misses.
</p>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11">61 x 67</h3>
<div class="outline-text-3" id="text-orgheadline11">
<p>
Same trick from 32 x 32 works here, use bigger block size (18-20).
</p>
</div>
</div>
</section>
</main>
<div id="postamble" class="status">
<div class="wrapper">
<div id='disqus_thread'></div>
<script type='text/javascript'>
 // required: replace example with your forum shortname
 var disqus_shortname = 'kevin5396blog';
 (function() {
     var dsq = document.createElement('script');
     dsq.type = 'text/javascript'; dsq.async = true;
     dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
     (document.getElementsByTagName('head')[0] ||
      document.getElementsByTagName('body')[0]).appendChild(dsq);
 })();
</script>
<noscript>
    <p>Please enable JavaScript to view the
    <a href='http://disqus.com/?ref_noscript'>comments powered by Disqus.</a></p>
</noscript>
</div>
<footer class="site-footer">
<div class="wrapper">
        <div class="footer-col-1 column">
            <ul>
                <li>Kevin's Blog</li>
            </ul>
        </div>
        <div class="footer-col-2 column">
            <ul>
                <li>
                    <a href="https://github.com/kevinkwl">
                        <span class="icon github">
                            <svg version="1.1" class="github-icon-svg" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
                                 viewBox="0 0 16 16" enable-background="new 0 0 16 16" xml:space="preserve">
                                <path fill-rule="evenodd" clip-rule="evenodd" fill="#C2C2C2" d="M7.999,0.431c-4.285,0-7.76,3.474-7.76,7.761
                                                                                                c0,3.428,2.223,6.337,5.307,7.363c0.388,0.071,0.53-0.168,0.53-0.374c0-0.184-0.007-0.672-0.01-1.32
                                                                                                c-2.159,0.469-2.614-1.04-2.614-1.04c-0.353-0.896-0.862-1.135-0.862-1.135c-0.705-0.481,0.053-0.472,0.053-0.472
                                                                                                c0.779,0.055,1.189,0.8,1.189,0.8c0.692,1.186,1.816,0.843,2.258,0.645c0.071-0.502,0.271-0.843,0.493-1.037
                                                                                                C4.86,11.425,3.049,10.76,3.049,7.786c0-0.847,0.302-1.54,0.799-2.082C3.768,5.507,3.501,4.718,3.924,3.65
                                                                                                c0,0,0.652-0.209,2.134,0.796C6.677,4.273,7.34,4.187,8,4.184c0.659,0.003,1.323,0.089,1.943,0.261
                                                                                                c1.482-1.004,2.132-0.796,2.132-0.796c0.423,1.068,0.157,1.857,0.077,2.054c0.497,0.542,0.798,1.235,0.798,2.082
                                                                                                c0,2.981-1.814,3.637-3.543,3.829c0.279,0.24,0.527,0.713,0.527,1.437c0,1.037-0.01,1.874-0.01,2.129
                                                                                                c0,0.208,0.14,0.449,0.534,0.373c3.081-1.028,5.302-3.935,5.302-7.362C15.76,3.906,12.285,0.431,7.999,0.431z"/>
                            </svg>
                        </span>
                        <span class="username">kevinkwl</span>
                    </a>
                </li> 
            </ul>
        </div>
        <div class="footer-col-3 column">
            <p class="text">Notes and Muses</p>
        </div>
    </div>
</footer>
<script type='text/javascript'>
 (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
     (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                          m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
 })(window,document,'script','http://www.google-analytics.com/analytics.js','ga');
 ga('create', 'UA-76818760-1', 'auto');
 ga('send', 'pageview');
</script>
<script src="/assets/js/main.js"></script>
</div>
</body>
</html>
